Revit 2027 API
RebarContainerParameterManager.IsOverriddenParameterModifiable Method
 Checks if overridden parameter is modifiable.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsOverriddenParameterModifiable(
	ElementId paramId
)
Public Function IsOverriddenParameterModifiable (
	paramId As ElementId
) As Boolean
public:
bool IsOverriddenParameterModifiable(
	ElementId^ paramId
)
member IsOverriddenParameterModifiable :
        paramId : ElementId -> bool
Parameters
paramId ElementId
 Overridden parameter id
Return Value
Boolean
 True if the parameter is modifiable, false if the parameter is readonly.
Exceptions
Exception | Condition
ArgumentException |  paramId has no override
ArgumentNullException |  A non-optional argument was null
See Also
Reference
RebarContainerParameterManager Class
Autodesk.Revit.DB.Structure Namespace